[
    {
        "image": "/cognizant_icon.png",
        "company": "Cognizant",
        "role": "Junior Software Developer",
        "descriptions": [
            "Developed and maintained responsive, interactive UIs using React, TypeScript, and JavaScript, applying modern component patterns and ensuring cross‑device compatibility.",
            "Built and deployed full-stack features, integrating Next.js and React front-ends with Spring Boot and PostgreSQL back-ends via REST APIs, resulting in seamless data flow and robust application functionality.",
            "Utilized Pandas and NumPy to clean, transform, and analyze large datasets, enabling faster insights and reducing manual data prep time by 40%.",
            "Developed and maintained Python/Selenium automation scripts for 20+ use cases, improving web application efficiency and saving over 200 hours annually.",
            "Integrated Unix shell scripting for scheduled tasks, cutting deployment time by 30% and improving system uptime.",
            "Collaborated with cross-functional teams (QA, DevOps, Product) to identify automation opportunities, translating business needs into technical solutions that reduced operational costs by 60%.",
            "Maintained and documented automation projects for project management applications, ensuring long-term sustainability and ease of use."
        ],
        "dates": "2023 - 2024"
    },
    {
        "image": "/cognizant_icon.png",
        "company": "Cognizant",
        "role": "Programmer Analyst Trainee",
        "descriptions": [
            "Built and maintained React and Redux front-ends for large-scale applications, improving state management and component reusability for a more efficient and scalable codebase.",
            "Contributed to the design and implementation of back-end services, including API design and database queries (MySQL, PostgreSQL), which enabled a 30% faster feature rollout for two key projects.",
            "Proactively integrated front-ends with RESTful Spring Boot APIs, utilizing Axios and Postman for reliable data handling and leveraging Jest for comprehensive unit and integration testing to ensure data integrity.",
            "Streamlined collaborative development by effectively utilizing version control systems (Git) for code management and bug tracking, resulting in a 50% reduction in merge conflicts.",
            "Collaborated effectively in Agile/Scrum teams, leading to a 20% increase in sprint completion rate and successful delivery of high-quality products on time."
          ],
        "dates": "2022 - 2023"
    },
    {
        "image": "/cognizant_icon.png",
        "company": "Cognizant",
        "role": "Software Developer Intern",
        "descriptions": [
            "Gained hands-on experience in building web applications with front-end (React) and back-end (Spring Boot).",
            "Developed front-end user interfaces using React, creating dynamic and responsive web applications.",
            "Developed back-end services and APIs with Java Spring Boot, contributing to the creation of robust and scalable applications.",
            "Managed database connections with web applications using Java tools (JDBC/Hibernate) and integrated front-end and back-end via APIs (Axios).",
            "Applied OOP and data structures principles, and deepened understanding of modern software design (microservices)."
          ],
        "dates": "2021 - 2022"
    }
]